Revit 2026 API

# EnergyDataSettingsBuildingOperatingSchedule Property

---

The operating schedule of the building used for conceptual model energy calculations.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public gbXMLBuildingOperatingSchedule BuildingOperatingSchedule { get; set; }
```
```vb
Public Property BuildingOperatingSchedule As gbXMLBuildingOperatingSchedule
	Get
	Set
```
```cpp
public:
property gbXMLBuildingOperatingSchedule BuildingOperatingSchedule {
	gbXMLBuildingOperatingSchedule get ();
	void set (gbXMLBuildingOperatingSchedule value);
}
```
```fsharp
member BuildingOperatingSchedule : gbXMLBuildingOperatingSchedule with get, set
```

#### Property Value

gbXMLBuildingOperatingSchedule

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The building operating schedule does not fall within an appropriate range. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace